WindowsApplication1/WindowsApplication1/bin/Debug/Log/Request/getSellQuote.xml

<soap:Envelope xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header />
  <soap:Body>
    <getSellQuote xmlns="http://api.ws.ba.com">
      <msgName>getSellQuote</msgName>
      <ClientID>500056</ClientID>
      <branchID>12</branchID>
      <tranType>NON-INVENTORY</tranType>
      <userID>CHINATOWN</userID>
      <currCode>USD</currCode>
      <spreadType>STANDARD</spreadType>
      <foreignAmount>0.00</foreignAmount>
      <localAmount>0.00</localAmount>
      <denominationMix>0</denominationMix>
      <requestSecToken>KbptBXZuykAPj9lFyMaK/nLzmN5e0/zlnPv84ZFRffZcB98UTalWi3WZRvryquryeV0FTJwG9nRuFXXbaMbsKruqrR1n7xAUXC3camNWagY+En7vOMQxsuMIkk022JMnuYMQFwDkbbd03q9scWTOCsxv/WbTSBCjGHcW/1KqBULenqF9UR53lLFR3tAmXOhRpqDd9cQlz3oo402A3WFCyr79q8a4UZzVl5LTNWQGBZciuII1BODcJMLFf58l608pPhqPpBPw9xFcvuxpp0mNmrvupWPkzqcT6rhFqzjpuVs=</requestSecToken>
    </getSellQuote>
  </soap:Body>
</soap:Envelope>